##
# Parameters
nc: 4  # number of classes
#depth_multiple: 0.67  # model depth multiple
#width_multiple: 0.75  # layer channel multiple
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]

  m: [0.67, 0.75, 768]   # YOLOv8QRm summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs



backbone:
  # [from, repeats, module, args]

  - [-1, 1,Conv , [64, 3, 2]]  # 0-P1/2#0
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4 1
#  - [-1,1,LightConv,[128,3]]#3
  - [-1, 3, C2f, [128, True]]#2
  #- [-1,1,C4f,[128]]


  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8#3
  - [-1, 6, C2f, [256, True]]#4
  #- [-1, 1, MCALayer,[256]]#6

  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16#5
  - [-1, 6, C2f, [512, True]]#6
  #- [-1, 1, MCALayer,[512]]#9

  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32#8
  - [-1, 3, C2f, [1024, True]]#8
  #- [-1, 1 ,MCALayer,[1024]]#12

  - [-1, 1, SPPF, [1024, 5]]  # 9
  #- [-1, 1, CPCAChannelAttention, [1024]]#10
  - [-1, 1,NLBlockND, [1024]]#10
# YOLOv8-QR.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4---6
  - [-1, 3, C2f, [512]] # 12

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3---5
  - [-1, 4, C2f, [256]]  # 16 (P3/8-small)#20---3
  - [-1, 3, LSKblockAttention, [256]] #17-

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]  # cat head P4---13
  - [-1, 3, C2f , [512]]  # 18 (P4/16-medium)#23
  - [-1, 3, LSKblockAttention, [512]] #21

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1,9], 1, Concat, [1]]  # cat head P5---9
  - [-1, 3, C2f , [1024]] # 21 (P5/32-large)#26
  - [-1, 3, LSKblockAttention, [1024]] #25

  - [[17, 21, 25], 1, Detect, [nc]]  # Detect(P3, P4, P5)
